{
  "irVersion": "7",
  "producerName": "pytorch",
  "producerVersion": "1.10",
  "graph": {
    "node": [
      {
        "input": [
          "0",
          "stem.0.weight"
        ],
        "output": [
          "149"
        ],
        "name": "Conv_0",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "149"
        ],
        "output": [
          "152"
        ],
        "name": "Cast_3",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "152",
          "153"
        ],
        "output": [
          "154"
        ],
        "name": "Mul_5",
        "opType": "Mul"
      },
      {
        "input": [
          "154",
          "155"
        ],
        "output": [
          "156"
        ],
        "name": "Div_7",
        "opType": "Div"
      },
      {
        "input": [
          "156"
        ],
        "output": [
          "157"
        ],
        "name": "Cast_8",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "157"
        ],
        "output": [
          "158"
        ],
        "name": "Cast_9",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "158"
        ],
        "output": [
          "159"
        ],
        "name": "Cast_10",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "159"
        ],
        "output": [
          "160"
        ],
        "name": "Clip_11",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "160",
          "stage1.0.proj.0.weight"
        ],
        "output": [
          "161"
        ],
        "name": "Conv_12",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "160",
          "stage1.0.conv1.weight"
        ],
        "output": [
          "164"
        ],
        "name": "Conv_15",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "164"
        ],
        "output": [
          "167"
        ],
        "name": "Cast_18",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "167",
          "168"
        ],
        "output": [
          "169"
        ],
        "name": "Mul_20",
        "opType": "Mul"
      },
      {
        "input": [
          "169",
          "170"
        ],
        "output": [
          "171"
        ],
        "name": "Div_22",
        "opType": "Div"
      },
      {
        "input": [
          "171"
        ],
        "output": [
          "172"
        ],
        "name": "Cast_23",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "172"
        ],
        "output": [
          "173"
        ],
        "name": "Cast_24",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "173"
        ],
        "output": [
          "174"
        ],
        "name": "Cast_25",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "174"
        ],
        "output": [
          "175"
        ],
        "name": "Clip_26",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "175",
          "stage1.0.conv2.weight"
        ],
        "output": [
          "176"
        ],
        "name": "Conv_27",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "176",
          "161"
        ],
        "output": [
          "179"
        ],
        "name": "Add_30",
        "opType": "Add"
      },
      {
        "input": [
          "179"
        ],
        "output": [
          "180"
        ],
        "name": "Cast_31",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "180",
          "181"
        ],
        "output": [
          "182"
        ],
        "name": "Mul_33",
        "opType": "Mul"
      },
      {
        "input": [
          "182",
          "183"
        ],
        "output": [
          "184"
        ],
        "name": "Div_35",
        "opType": "Div"
      },
      {
        "input": [
          "184"
        ],
        "output": [
          "185"
        ],
        "name": "Cast_36",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "185"
        ],
        "output": [
          "186"
        ],
        "name": "Cast_37",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "186"
        ],
        "output": [
          "187"
        ],
        "name": "Cast_38",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "187"
        ],
        "output": [
          "188"
        ],
        "name": "Clip_39",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "188",
          "stage1.1.conv1.weight"
        ],
        "output": [
          "189"
        ],
        "name": "Conv_40",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "189"
        ],
        "output": [
          "192"
        ],
        "name": "Cast_43",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "192",
          "193"
        ],
        "output": [
          "194"
        ],
        "name": "Mul_45",
        "opType": "Mul"
      },
      {
        "input": [
          "194",
          "195"
        ],
        "output": [
          "196"
        ],
        "name": "Div_47",
        "opType": "Div"
      },
      {
        "input": [
          "196"
        ],
        "output": [
          "197"
        ],
        "name": "Cast_48",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "197"
        ],
        "output": [
          "198"
        ],
        "name": "Cast_49",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "198"
        ],
        "output": [
          "199"
        ],
        "name": "Cast_50",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "199"
        ],
        "output": [
          "200"
        ],
        "name": "Clip_51",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "200",
          "stage1.1.conv2.weight"
        ],
        "output": [
          "201"
        ],
        "name": "Conv_52",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "201",
          "188"
        ],
        "output": [
          "204"
        ],
        "name": "Add_55",
        "opType": "Add"
      },
      {
        "input": [
          "204"
        ],
        "output": [
          "205"
        ],
        "name": "Cast_56",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "205",
          "206"
        ],
        "output": [
          "207"
        ],
        "name": "Mul_58",
        "opType": "Mul"
      },
      {
        "input": [
          "207",
          "208"
        ],
        "output": [
          "209"
        ],
        "name": "Div_60",
        "opType": "Div"
      },
      {
        "input": [
          "209"
        ],
        "output": [
          "210"
        ],
        "name": "Cast_61",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "210"
        ],
        "output": [
          "211"
        ],
        "name": "Cast_62",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "211"
        ],
        "output": [
          "212"
        ],
        "name": "Cast_63",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "212"
        ],
        "output": [
          "213"
        ],
        "name": "Clip_64",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "213",
          "stage2.0.proj.0.weight"
        ],
        "output": [
          "214"
        ],
        "name": "Conv_65",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "213",
          "stage2.0.conv1.weight"
        ],
        "output": [
          "217"
        ],
        "name": "Conv_68",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "217"
        ],
        "output": [
          "220"
        ],
        "name": "Cast_71",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "220",
          "221"
        ],
        "output": [
          "222"
        ],
        "name": "Mul_73",
        "opType": "Mul"
      },
      {
        "input": [
          "222",
          "223"
        ],
        "output": [
          "224"
        ],
        "name": "Div_75",
        "opType": "Div"
      },
      {
        "input": [
          "224"
        ],
        "output": [
          "225"
        ],
        "name": "Cast_76",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "225"
        ],
        "output": [
          "226"
        ],
        "name": "Cast_77",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "226"
        ],
        "output": [
          "227"
        ],
        "name": "Cast_78",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "227"
        ],
        "output": [
          "228"
        ],
        "name": "Clip_79",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "228",
          "stage2.0.conv2.weight"
        ],
        "output": [
          "229"
        ],
        "name": "Conv_80",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "229",
          "214"
        ],
        "output": [
          "232"
        ],
        "name": "Add_83",
        "opType": "Add"
      },
      {
        "input": [
          "232"
        ],
        "output": [
          "233"
        ],
        "name": "Cast_84",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "233",
          "234"
        ],
        "output": [
          "235"
        ],
        "name": "Mul_86",
        "opType": "Mul"
      },
      {
        "input": [
          "235",
          "236"
        ],
        "output": [
          "237"
        ],
        "name": "Div_88",
        "opType": "Div"
      },
      {
        "input": [
          "237"
        ],
        "output": [
          "238"
        ],
        "name": "Cast_89",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "238"
        ],
        "output": [
          "239"
        ],
        "name": "Cast_90",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "239"
        ],
        "output": [
          "240"
        ],
        "name": "Cast_91",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "240"
        ],
        "output": [
          "241"
        ],
        "name": "Clip_92",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "241",
          "stage2.1.conv1.weight"
        ],
        "output": [
          "242"
        ],
        "name": "Conv_93",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "242"
        ],
        "output": [
          "245"
        ],
        "name": "Cast_96",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "245",
          "246"
        ],
        "output": [
          "247"
        ],
        "name": "Mul_98",
        "opType": "Mul"
      },
      {
        "input": [
          "247",
          "248"
        ],
        "output": [
          "249"
        ],
        "name": "Div_100",
        "opType": "Div"
      },
      {
        "input": [
          "249"
        ],
        "output": [
          "250"
        ],
        "name": "Cast_101",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "250"
        ],
        "output": [
          "251"
        ],
        "name": "Cast_102",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "251"
        ],
        "output": [
          "252"
        ],
        "name": "Cast_103",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "252"
        ],
        "output": [
          "253"
        ],
        "name": "Clip_104",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "253",
          "stage2.1.conv2.weight"
        ],
        "output": [
          "254"
        ],
        "name": "Conv_105",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "254",
          "241"
        ],
        "output": [
          "257"
        ],
        "name": "Add_108",
        "opType": "Add"
      },
      {
        "input": [
          "257"
        ],
        "output": [
          "258"
        ],
        "name": "Cast_109",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "258",
          "259"
        ],
        "output": [
          "260"
        ],
        "name": "Mul_111",
        "opType": "Mul"
      },
      {
        "input": [
          "260",
          "261"
        ],
        "output": [
          "262"
        ],
        "name": "Div_113",
        "opType": "Div"
      },
      {
        "input": [
          "262"
        ],
        "output": [
          "263"
        ],
        "name": "Cast_114",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "263"
        ],
        "output": [
          "264"
        ],
        "name": "Cast_115",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "264"
        ],
        "output": [
          "265"
        ],
        "name": "Cast_116",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "265"
        ],
        "output": [
          "266"
        ],
        "name": "Clip_117",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "266",
          "stage3.0.proj.0.weight"
        ],
        "output": [
          "267"
        ],
        "name": "Conv_118",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "266",
          "stage3.0.conv1.weight"
        ],
        "output": [
          "270"
        ],
        "name": "Conv_121",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "270"
        ],
        "output": [
          "273"
        ],
        "name": "Cast_124",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "273",
          "274"
        ],
        "output": [
          "275"
        ],
        "name": "Mul_126",
        "opType": "Mul"
      },
      {
        "input": [
          "275",
          "276"
        ],
        "output": [
          "277"
        ],
        "name": "Div_128",
        "opType": "Div"
      },
      {
        "input": [
          "277"
        ],
        "output": [
          "278"
        ],
        "name": "Cast_129",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "278"
        ],
        "output": [
          "279"
        ],
        "name": "Cast_130",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "279"
        ],
        "output": [
          "280"
        ],
        "name": "Cast_131",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "280"
        ],
        "output": [
          "281"
        ],
        "name": "Clip_132",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "281",
          "stage3.0.conv2.weight"
        ],
        "output": [
          "282"
        ],
        "name": "Conv_133",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "282",
          "267"
        ],
        "output": [
          "285"
        ],
        "name": "Add_136",
        "opType": "Add"
      },
      {
        "input": [
          "285"
        ],
        "output": [
          "286"
        ],
        "name": "Cast_137",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "286",
          "287"
        ],
        "output": [
          "288"
        ],
        "name": "Mul_139",
        "opType": "Mul"
      },
      {
        "input": [
          "288",
          "289"
        ],
        "output": [
          "290"
        ],
        "name": "Div_141",
        "opType": "Div"
      },
      {
        "input": [
          "290"
        ],
        "output": [
          "291"
        ],
        "name": "Cast_142",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "291"
        ],
        "output": [
          "292"
        ],
        "name": "Cast_143",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "292"
        ],
        "output": [
          "293"
        ],
        "name": "Cast_144",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "293"
        ],
        "output": [
          "294"
        ],
        "name": "Clip_145",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "294",
          "stage3.1.conv1.weight"
        ],
        "output": [
          "295"
        ],
        "name": "Conv_146",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "295"
        ],
        "output": [
          "298"
        ],
        "name": "Cast_149",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "298",
          "299"
        ],
        "output": [
          "300"
        ],
        "name": "Mul_151",
        "opType": "Mul"
      },
      {
        "input": [
          "300",
          "301"
        ],
        "output": [
          "302"
        ],
        "name": "Div_153",
        "opType": "Div"
      },
      {
        "input": [
          "302"
        ],
        "output": [
          "303"
        ],
        "name": "Cast_154",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "303"
        ],
        "output": [
          "304"
        ],
        "name": "Cast_155",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "304"
        ],
        "output": [
          "305"
        ],
        "name": "Cast_156",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "305"
        ],
        "output": [
          "306"
        ],
        "name": "Clip_157",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "306",
          "stage3.1.conv2.weight"
        ],
        "output": [
          "307"
        ],
        "name": "Conv_158",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "307",
          "294"
        ],
        "output": [
          "310"
        ],
        "name": "Add_161",
        "opType": "Add"
      },
      {
        "input": [
          "310"
        ],
        "output": [
          "311"
        ],
        "name": "Cast_162",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "311",
          "312"
        ],
        "output": [
          "313"
        ],
        "name": "Mul_164",
        "opType": "Mul"
      },
      {
        "input": [
          "313",
          "314"
        ],
        "output": [
          "315"
        ],
        "name": "Div_166",
        "opType": "Div"
      },
      {
        "input": [
          "315"
        ],
        "output": [
          "316"
        ],
        "name": "Cast_167",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "316"
        ],
        "output": [
          "317"
        ],
        "name": "Cast_168",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "317"
        ],
        "output": [
          "318"
        ],
        "name": "Cast_169",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "318"
        ],
        "output": [
          "319"
        ],
        "name": "Clip_170",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "319",
          "stage4.0.proj.0.weight"
        ],
        "output": [
          "320"
        ],
        "name": "Conv_171",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "319",
          "stage4.0.conv1.weight"
        ],
        "output": [
          "323"
        ],
        "name": "Conv_174",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "323"
        ],
        "output": [
          "326"
        ],
        "name": "Cast_177",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "326",
          "327"
        ],
        "output": [
          "328"
        ],
        "name": "Mul_179",
        "opType": "Mul"
      },
      {
        "input": [
          "328",
          "329"
        ],
        "output": [
          "330"
        ],
        "name": "Div_181",
        "opType": "Div"
      },
      {
        "input": [
          "330"
        ],
        "output": [
          "331"
        ],
        "name": "Cast_182",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "331"
        ],
        "output": [
          "332"
        ],
        "name": "Cast_183",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "332"
        ],
        "output": [
          "333"
        ],
        "name": "Cast_184",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "333"
        ],
        "output": [
          "334"
        ],
        "name": "Clip_185",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "334",
          "stage4.0.conv2.weight"
        ],
        "output": [
          "335"
        ],
        "name": "Conv_186",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "335",
          "320"
        ],
        "output": [
          "338"
        ],
        "name": "Add_189",
        "opType": "Add"
      },
      {
        "input": [
          "338"
        ],
        "output": [
          "339"
        ],
        "name": "Cast_190",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "339",
          "340"
        ],
        "output": [
          "341"
        ],
        "name": "Mul_192",
        "opType": "Mul"
      },
      {
        "input": [
          "341",
          "342"
        ],
        "output": [
          "343"
        ],
        "name": "Div_194",
        "opType": "Div"
      },
      {
        "input": [
          "343"
        ],
        "output": [
          "344"
        ],
        "name": "Cast_195",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "344"
        ],
        "output": [
          "345"
        ],
        "name": "Cast_196",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "345"
        ],
        "output": [
          "346"
        ],
        "name": "Cast_197",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "346"
        ],
        "output": [
          "347"
        ],
        "name": "Clip_198",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "347",
          "stage4.1.conv1.weight"
        ],
        "output": [
          "348"
        ],
        "name": "Conv_199",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
