{
  "irVersion": "7",
  "producerName": "pytorch",
  "producerVersion": "1.10",
  "graph": {
    "node": [
      {
        "input": [
          "input.1"
        ],
        "output": [
          "128"
        ],
        "name": "Pad_0",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "1",
              "1",
              "0",
              "0",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "128",
          "stem.0.weight",
          "stem.0.bias"
        ],
        "output": [
          "129"
        ],
        "name": "Conv_1",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "129"
        ],
        "output": [
          "130"
        ],
        "name": "Cast_2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "130",
          "131"
        ],
        "output": [
          "132"
        ],
        "name": "Mul_4",
        "opType": "Mul"
      },
      {
        "input": [
          "132",
          "133"
        ],
        "output": [
          "134"
        ],
        "name": "Div_6",
        "opType": "Div"
      },
      {
        "input": [
          "134"
        ],
        "output": [
          "135"
        ],
        "name": "Cast_7",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "135"
        ],
        "output": [
          "136"
        ],
        "name": "Cast_8",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "136"
        ],
        "output": [
          "137"
        ],
        "name": "Cast_9",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "137"
        ],
        "output": [
          "138"
        ],
        "name": "Clip_10",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "138"
        ],
        "output": [
          "139"
        ],
        "name": "Pad_11",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "139",
          "stage1.0.proj.0.weight",
          "stage1.0.proj.0.bias"
        ],
        "output": [
          "140"
        ],
        "name": "Conv_12",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "138"
        ],
        "output": [
          "141"
        ],
        "name": "Pad_13",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "1",
              "1",
              "0",
              "0",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "141",
          "stage1.0.conv1.weight",
          "stage1.0.conv1.bias"
        ],
        "output": [
          "142"
        ],
        "name": "Conv_14",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "142"
        ],
        "output": [
          "143"
        ],
        "name": "Cast_15",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "143",
          "144"
        ],
        "output": [
          "145"
        ],
        "name": "Mul_17",
        "opType": "Mul"
      },
      {
        "input": [
          "145",
          "146"
        ],
        "output": [
          "147"
        ],
        "name": "Div_19",
        "opType": "Div"
      },
      {
        "input": [
          "147"
        ],
        "output": [
          "148"
        ],
        "name": "Cast_20",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "148"
        ],
        "output": [
          "149"
        ],
        "name": "Cast_21",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "149"
        ],
        "output": [
          "150"
        ],
        "name": "Cast_22",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "150"
        ],
        "output": [
          "151"
        ],
        "name": "Clip_23",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "151"
        ],
        "output": [
          "152"
        ],
        "name": "Pad_24",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "1",
              "1",
              "0",
              "0",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "152",
          "stage1.0.conv2.weight",
          "stage1.0.conv2.bias"
        ],
        "output": [
          "153"
        ],
        "name": "Conv_25",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "153",
          "154"
        ],
        "output": [
          "155"
        ],
        "name": "Mul_27",
        "opType": "Mul"
      },
      {
        "input": [
          "140",
          "156"
        ],
        "output": [
          "157"
        ],
        "name": "Mul_29",
        "opType": "Mul"
      },
      {
        "input": [
          "155",
          "157"
        ],
        "output": [
          "158"
        ],
        "name": "Add_30",
        "opType": "Add"
      },
      {
        "input": [
          "158",
          "405"
        ],
        "output": [
          "161"
        ],
        "name": "Div_31",
        "opType": "Div"
      },
      {
        "input": [
          "161"
        ],
        "output": [
          "162"
        ],
        "name": "Floor_32",
        "opType": "Floor"
      },
      {
        "input": [
          "162"
        ],
        "output": [
          "163"
        ],
        "name": "Cast_33",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "163",
          "164"
        ],
        "output": [
          "165"
        ],
        "name": "Mul_35",
        "opType": "Mul"
      },
      {
        "input": [
          "165",
          "166"
        ],
        "output": [
          "167"
        ],
        "name": "Div_37",
        "opType": "Div"
      },
      {
        "input": [
          "167"
        ],
        "output": [
          "168"
        ],
        "name": "Cast_38",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "168"
        ],
        "output": [
          "169"
        ],
        "name": "Cast_39",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "169"
        ],
        "output": [
          "170"
        ],
        "name": "Cast_40",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "170"
        ],
        "output": [
          "171"
        ],
        "name": "Clip_41",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "171"
        ],
        "output": [
          "172"
        ],
        "name": "Pad_42",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "1",
              "1",
              "0",
              "0",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "172",
          "stage1.1.conv1.weight",
          "stage1.1.conv1.bias"
        ],
        "output": [
          "173"
        ],
        "name": "Conv_43",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "173"
        ],
        "output": [
          "174"
        ],
        "name": "Cast_44",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "174",
          "175"
        ],
        "output": [
          "176"
        ],
        "name": "Mul_46",
        "opType": "Mul"
      },
      {
        "input": [
          "176",
          "177"
        ],
        "output": [
          "178"
        ],
        "name": "Div_48",
        "opType": "Div"
      },
      {
        "input": [
          "178"
        ],
        "output": [
          "179"
        ],
        "name": "Cast_49",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "179"
        ],
        "output": [
          "180"
        ],
        "name": "Cast_50",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "180"
        ],
        "output": [
          "181"
        ],
        "name": "Cast_51",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "181"
        ],
        "output": [
          "182"
        ],
        "name": "Clip_52",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "182"
        ],
        "output": [
          "183"
        ],
        "name": "Pad_53",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "1",
              "1",
              "0",
              "0",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "183",
          "stage1.1.conv2.weight",
          "stage1.1.conv2.bias"
        ],
        "output": [
          "184"
        ],
        "name": "Conv_54",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "184",
          "185"
        ],
        "output": [
          "186"
        ],
        "name": "Mul_56",
        "opType": "Mul"
      },
      {
        "input": [
          "171",
          "187"
        ],
        "output": [
          "188"
        ],
        "name": "Mul_58",
        "opType": "Mul"
      },
      {
        "input": [
          "186",
          "188"
        ],
        "output": [
          "189"
        ],
        "name": "Add_59",
        "opType": "Add"
      },
      {
        "input": [
          "189",
          "406"
        ],
        "output": [
          "192"
        ],
        "name": "Div_60",
        "opType": "Div"
      },
      {
        "input": [
          "192"
        ],
        "output": [
          "193"
        ],
        "name": "Floor_61",
        "opType": "Floor"
      },
      {
        "input": [
          "193"
        ],
        "output": [
          "194"
        ],
        "name": "Cast_62",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "194",
          "195"
        ],
        "output": [
          "196"
        ],
        "name": "Mul_64",
        "opType": "Mul"
      },
      {
        "input": [
          "196",
          "197"
        ],
        "output": [
          "198"
        ],
        "name": "Div_66",
        "opType": "Div"
      },
      {
        "input": [
          "198"
        ],
        "output": [
          "199"
        ],
        "name": "Cast_67",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "199"
        ],
        "output": [
          "200"
        ],
        "name": "Cast_68",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "200"
        ],
        "output": [
          "201"
        ],
        "name": "Cast_69",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "201"
        ],
        "output": [
          "202"
        ],
        "name": "Clip_70",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "202"
        ],
        "output": [
          "203"
        ],
        "name": "Pad_71",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "203",
          "stage2.0.proj.0.weight",
          "stage2.0.proj.0.bias"
        ],
        "output": [
          "204"
        ],
        "name": "Conv_72",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "202"
        ],
        "output": [
          "205"
        ],
        "name": "Pad_73",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "1",
              "1",
              "0",
              "0",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "205",
          "stage2.0.conv1.weight",
          "stage2.0.conv1.bias"
        ],
        "output": [
          "206"
        ],
        "name": "Conv_74",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "206"
        ],
        "output": [
          "207"
        ],
        "name": "Cast_75",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "207",
          "208"
        ],
        "output": [
          "209"
        ],
        "name": "Mul_77",
        "opType": "Mul"
      },
      {
        "input": [
          "209",
          "210"
        ],
        "output": [
          "211"
        ],
        "name": "Div_79",
        "opType": "Div"
      },
      {
        "input": [
          "211"
        ],
        "output": [
          "212"
        ],
        "name": "Cast_80",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "212"
        ],
        "output": [
          "213"
        ],
        "name": "Cast_81",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "213"
        ],
        "output": [
          "214"
        ],
        "name": "Cast_82",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "214"
        ],
        "output": [
          "215"
        ],
        "name": "Clip_83",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "215"
        ],
        "output": [
          "216"
        ],
        "name": "Pad_84",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "1",
              "1",
              "0",
              "0",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "216",
          "stage2.0.conv2.weight",
          "stage2.0.conv2.bias"
        ],
        "output": [
          "217"
        ],
        "name": "Conv_85",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "217",
          "218"
        ],
        "output": [
          "219"
        ],
        "name": "Mul_87",
        "opType": "Mul"
      },
      {
        "input": [
          "204",
          "220"
        ],
        "output": [
          "221"
        ],
        "name": "Mul_89",
        "opType": "Mul"
      },
      {
        "input": [
          "219",
          "221"
        ],
        "output": [
          "222"
        ],
        "name": "Add_90",
        "opType": "Add"
      },
      {
        "input": [
          "222",
          "407"
        ],
        "output": [
          "225"
        ],
        "name": "Div_91",
        "opType": "Div"
      },
      {
        "input": [
          "225"
        ],
        "output": [
          "226"
        ],
        "name": "Floor_92",
        "opType": "Floor"
      },
      {
        "input": [
          "226"
        ],
        "output": [
          "227"
        ],
        "name": "Cast_93",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "227",
          "228"
        ],
        "output": [
          "229"
        ],
        "name": "Mul_95",
        "opType": "Mul"
      },
      {
        "input": [
          "229",
          "230"
        ],
        "output": [
          "231"
        ],
        "name": "Div_97",
        "opType": "Div"
      },
      {
        "input": [
          "231"
        ],
        "output": [
          "232"
        ],
        "name": "Cast_98",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "232"
        ],
        "output": [
          "233"
        ],
        "name": "Cast_99",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "233"
        ],
        "output": [
          "234"
        ],
        "name": "Cast_100",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "234"
        ],
        "output": [
          "235"
        ],
        "name": "Clip_101",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "235"
        ],
        "output": [
          "236"
        ],
        "name": "Pad_102",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "1",
              "1",
              "0",
              "0",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "236",
          "stage2.1.conv1.weight",
          "stage2.1.conv1.bias"
        ],
        "output": [
          "237"
        ],
        "name": "Conv_103",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "237"
        ],
        "output": [
          "238"
        ],
        "name": "Cast_104",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "238",
          "239"
        ],
        "output": [
          "240"
        ],
        "name": "Mul_106",
        "opType": "Mul"
      },
      {
        "input": [
          "240",
          "241"
        ],
        "output": [
          "242"
        ],
        "name": "Div_108",
        "opType": "Div"
      },
      {
        "input": [
          "242"
        ],
        "output": [
          "243"
        ],
        "name": "Cast_109",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "243"
        ],
        "output": [
          "244"
        ],
        "name": "Cast_110",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "244"
        ],
        "output": [
          "245"
        ],
        "name": "Cast_111",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "245"
        ],
        "output": [
          "246"
        ],
        "name": "Clip_112",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "246"
        ],
        "output": [
          "247"
        ],
        "name": "Pad_113",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "1",
              "1",
              "0",
              "0",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "247",
          "stage2.1.conv2.weight",
          "stage2.1.conv2.bias"
        ],
        "output": [
          "248"
        ],
        "name": "Conv_114",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "248",
          "249"
        ],
        "output": [
          "250"
        ],
        "name": "Mul_116",
        "opType": "Mul"
      },
      {
        "input": [
          "235",
          "251"
        ],
        "output": [
          "252"
        ],
        "name": "Mul_118",
        "opType": "Mul"
      },
      {
        "input": [
          "250",
          "252"
        ],
        "output": [
          "253"
        ],
        "name": "Add_119",
        "opType": "Add"
      },
      {
        "input": [
          "253",
          "408"
        ],
        "output": [
          "256"
        ],
        "name": "Div_120",
        "opType": "Div"
      },
      {
        "input": [
          "256"
        ],
        "output": [
          "257"
        ],
        "name": "Floor_121",
        "opType": "Floor"
      },
      {
        "input": [
          "257"
        ],
        "output": [
          "258"
        ],
        "name": "Cast_122",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "258",
          "259"
        ],
        "output": [
          "260"
        ],
        "name": "Mul_124",
        "opType": "Mul"
      },
      {
        "input": [
          "260",
          "261"
        ],
        "output": [
          "262"
        ],
        "name": "Div_126",
        "opType": "Div"
      },
      {
        "input": [
          "262"
        ],
        "output": [
          "263"
        ],
        "name": "Cast_127",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "263"
        ],
        "output": [
          "264"
        ],
        "name": "Cast_128",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "264"
        ],
        "output": [
          "265"
        ],
        "name": "Cast_129",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "265"
        ],
        "output": [
          "266"
        ],
        "name": "Clip_130",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "266"
        ],
        "output": [
          "267"
        ],
        "name": "Pad_131",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "267",
          "stage3.0.proj.0.weight",
          "stage3.0.proj.0.bias"
        ],
        "output": [
          "268"
        ],
        "name": "Conv_132",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "266"
        ],
        "output": [
          "269"
        ],
        "name": "Pad_133",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "1",
              "1",
              "0",
              "0",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "269",
          "stage3.0.conv1.weight",
          "stage3.0.conv1.bias"
        ],
        "output": [
          "270"
        ],
        "name": "Conv_134",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "2",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "270"
        ],
        "output": [
          "271"
        ],
        "name": "Cast_135",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "271",
          "272"
        ],
        "output": [
          "273"
        ],
        "name": "Mul_137",
        "opType": "Mul"
      },
      {
        "input": [
          "273",
          "274"
        ],
        "output": [
          "275"
        ],
        "name": "Div_139",
        "opType": "Div"
      },
      {
        "input": [
          "275"
        ],
        "output": [
          "276"
        ],
        "name": "Cast_140",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "276"
        ],
        "output": [
          "277"
        ],
        "name": "Cast_141",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "277"
        ],
        "output": [
          "278"
        ],
        "name": "Cast_142",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "278"
        ],
        "output": [
          "279"
        ],
        "name": "Clip_143",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "279"
        ],
        "output": [
          "280"
        ],
        "name": "Pad_144",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
            "s": "Y29uc3RhbnQ=",
            "type": "STRING"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "1",
              "1",
              "0",
              "0",
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "value",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "280",
          "stage3.0.conv2.weight",
          "stage3.0.conv2.bias"
        ],
        "output": [
          "281"
        ],
        "name": "Conv_145",
        "opType": "Conv",
        "attribute": [
          {
            "name": "dilations",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          },
          {
            "name": "group",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "kernel_shape",
            "ints": [
              "3",
              "3"
            ],
            "type": "INTS"
          },
          {
            "name": "pads",
            "ints": [
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          },
          {
            "name": "strides",
            "ints": [
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "281",
          "282"
        ],
        "output": [
          "283"
        ],
        "name": "Mul_147",
        "opType": "Mul"
      },
      {
        "input": [
          "268",
          "284"
        ],
        "output": [
          "285"
        ],
        "name": "Mul_149",
        "opType": "Mul"
      },
      {
        "input": [
          "283",
          "285"
        ],
        "output": [
          "286"
        ],
        "name": "Add_150",
        "opType": "Add"
      },
      {
        "input": [
          "286",
          "409"
        ],
        "output": [
          "289"
        ],
        "name": "Div_151",
        "opType": "Div"
      },
      {
        "input": [
          "289"
        ],
        "output": [
          "290"
        ],
        "name": "Floor_152",
        "opType": "Floor"
      },
      {
        "input": [
          "290"
        ],
        "output": [
          "291"
        ],
        "name": "Cast_153",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "291",
          "292"
        ],
        "output": [
          "293"
        ],
        "name": "Mul_155",
        "opType": "Mul"
      },
      {
        "input": [
          "293",
          "294"
        ],
        "output": [
          "295"
        ],
        "name": "Div_157",
        "opType": "Div"
      },
      {
        "input": [
          "295"
        ],
        "output": [
          "296"
        ],
        "name": "Cast_158",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "296"
        ],
        "output": [
          "297"
        ],
        "name": "Cast_159",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "297"
        ],
        "output": [
          "298"
        ],
        "name": "Cast_160",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "298"
        ],
        "output": [
          "299"
        ],
        "name": "Clip_161",
        "opType": "Clip",
        "attribute": [
          {
            "name": "max",
            "f": 255.0,
            "type": "FLOAT"
          },
          {
            "name": "min",
            "f": 0.0,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "299"
        ],
        "output": [
          "300"
        ],
        "name": "Pad_162",
        "opType": "Pad",
        "attribute": [
          {
            "name": "mode",
